# range(start, stop, step)


#for i in range(2, 10+1):
#   print(i)

#for i in range(6):
#   print(i)

#for i in range(20,25):
#   print(i)

#for i in range(0,15,3):
#   print(i)

#for i in range(100,0,-10):
#   print(i)

#Списъци и други типове последователности от данни също могат да се използват
# като параметри на итерация в цикли for. Вместо да итерирате през range(), можете да дефинирате списък
# и да итерирате през този списък.

#Ще присвоим списък на променлива и след това ще преминем през списъка:
# В този случай ние разпечатваме всеки елемент от списъка. Въпреки че използвахме променливата shark,
# можехме да
# наречем променливата с всяко друго валидно име на променлива и щяхме да получим същия резултат:

#sharks = ['hammerhead', 'great white', 'dogfish', 'frilled', 'bullhead', 'requiem']

#for shark in sharks:
#   print(shark)

#Резултатът по-горе показва, че цикълът for итерира през списъка и отпечатва всеки елемент от списъка на ред.

#Списъците и други кортежи, базирани на последователности,
# са обичайни за използване с цикли, защото могат да се повтарят.
# Можете да комбинирате тези типове данни с range(), за да добавите елементи към списък, например:

#sharks = ['hammerhead', 'great white', 'dogfish', 'frilled', 'bullhead', 'requiem']

#for item in range(len(sharks)):
#   sharks.append('shark')

#print(sharks)



#Можете също така да използвате цикъл for, за да създадете списък от нулата:

integers = []

for i in range(10):
   integers.append(i)

print(integers)


# По подобен начин можем да итерираме през низове:
#
sammy = 'Sammy'

for letter in sammy:
    print(letter)


# Итерирането през кортежи се извършва в същия формат като итерирането през списъци или низове по-горе.
#
# Когато итерирате през речник, важно е да имате предвид структурата ключ :
# стойност, за да сте сигурни, че извиквате правилния елемент от речника.
# Ето пример, който извиква както ключа, така и стойността:

sammy_shark = {'name': 'Sammy', 'animal': 'shark', 'color': 'blue', 'location': 'ocean'}

for key in sammy_shark:
    print(key + ': ' + sammy_shark[key])

# Когато използвате речници с цикли for, итериращата променлива съответства на ключовете на речника,
# а dictionary_variable[iterating_variable] съответства на стойностите.
# В случая по-горе, повтарящата се променлива key беше използвана за означаване на ключ, а sammy_shark[key]
# беше използвана за означаване на стойностите.
#
# Циклите често се използват за повторение и манипулиране на последователни типове данни.

